{
  "nodes": [
    {
      "op": "null", 
      "name": "target", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "target_embed_weight", 
      "attrs": {"__shape__": "(9, 32)"}, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "target_embed_embed", 
      "attrs": {
        "input_dim": "9", 
        "output_dim": "32"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar4", 
      "attrs": {"scalar": "5.656854249492381"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "_arange3", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "0", 
        "step": "1.0", 
        "stop": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims4", 
      "attrs": {"axis": "1"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "_arange4", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "0", 
        "step": "1.0", 
        "stop": "16"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar3", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar1", 
      "attrs": {"scalar": "32"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "_rpower_scalar", 
      "name": "_rpowerscalar1", 
      "attrs": {"scalar": "10000"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "_rdiv_scalar", 
      "name": "_rdivscalar1", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims5", 
      "attrs": {"axis": "0"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot1", 
      "inputs": [[5, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin1", 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos1", 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad2", 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "target_pos_embed__add", 
      "inputs": [[3, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_self_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_self_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "decoder_transformer_0_att_self_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_self_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(96, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "decoder_transformer_0_att_self_i2h_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "96"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "decoder_transformer_0_att_self_split0", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "decoder_transformer_0_att_self__mulscalar0", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_self_reshape0", 
      "attrs": {"shape": "(0, -1, 8, 4)"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "decoder_transformer_0_att_self_transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_self_reshape1", 
      "attrs": {"shape": "(-3, -1, 4)"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_self_reshape2", 
      "attrs": {"shape": "(0, -1, 8, 4)"}, 
      "inputs": [[24, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "decoder_transformer_0_att_self_transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_self_reshape3", 
      "attrs": {"shape": "(-3, -1, 4)"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "decoder_transformer_0_att_self_dot_attbatch_dot0", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[28, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "_arange2", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "100", 
        "step": "1.0", 
        "stop": "None"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(1, -1)"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape1", 
      "attrs": {"shape": "(-1, 1)"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "broadcast_greater", 
      "name": "broadcast_greater0", 
      "inputs": [[34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attrs": {"scalar": "-99999999.0"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape2", 
      "attrs": {"shape": "(1, 100, 100)"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1", 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "decoder_transformer_0_att_self_dot_attbroadcast_add0", 
      "inputs": [[32, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "decoder_transformer_0_att_self_dot_attsoftmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "decoder_transformer_0_att_self_dot_attdropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_self_reshape4", 
      "attrs": {"shape": "(0, -1, 8, 4)"}, 
      "inputs": [[24, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "decoder_transformer_0_att_self_transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_self_reshape5", 
      "attrs": {"shape": "(-3, -1, 4)"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "decoder_transformer_0_att_self_dot_attbatch_dot1", 
      "inputs": [[42, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_self_reshape6", 
      "attrs": {"shape": "(-4, -1, 8, 0, 4)"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "decoder_transformer_0_att_self_transpose3", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_self_reshape7", 
      "attrs": {"shape": "(-1, 0, 32)"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_self_h2o_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "decoder_transformer_0_att_self_h2o_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "32"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "decoder_transformer_0_att_self_post_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "decoder_transformer_0_att_self_post__plus0", 
      "inputs": [[52, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_enc_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_enc_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "decoder_transformer_0_att_enc_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "decoder_transformer_0_att_enc_q2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "decoder_transformer_0_att_enc_q2h_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "32"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "decoder_transformer_0_att_enc__mulscalar0", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[58, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_enc_reshape0", 
      "attrs": {"shape": "(0, -1, 8, 4)"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "decoder_transformer_0_att_enc_transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "decoder_transformer_0_att_enc_reshape1", 
      "attrs": {"shape": "(-3, -1, 4)"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "source", 
      "inputs": []
    }, 
    {
      "op": "SliceChannel", 
      "name": "source_embed_factor_split", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "2", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "source_embed_weight", 
      "attrs": {"__shape__": "(35, 32)"}, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "source_embed_embed", 
      "attrs": {
        "input_dim": "35", 
        "output_dim": "32"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "source_embed_factor0_weight", 
      "attrs": {"__shape__": "(24, 16)"}, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "source_embed_factor0_embed", 
      "attrs": {
        "input_dim": "24", 
        "output_dim": "16"
      }, 
      "inputs": [[64, 1, 0], [67, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "source_embed_embed_plus_factors", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[66, 0, 0], [68, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attrs": {"scalar": "6.928203230275509"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "_arange0", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "0", 
        "step": "1.0", 
        "stop": "100"
      }, 
      "inputs": []
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "_arange", 
      "name": "_arange1", 
      "attrs": {
        "dtype": "float32", 
        "infer_range": "False", 
        "repeat": "1", 
        "start": "0", 
        "step": "1.0", 
        "stop": "24"
      }, 
      "inputs": []
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "_div_scalar", 
      "name": "_divscalar0", 
      "attrs": {"scalar": "48"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "_rpower_scalar", 
      "name": "_rpowerscalar0", 
      "attrs": {"scalar": "10000"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "_rdiv_scalar", 
      "name": "_rdivscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims1", 
      "attrs": {"axis": "0"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "dot0", 
      "inputs": [[72, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "sin", 
      "name": "sin0", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "cos", 
      "name": "cos0", 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "source_pos_embed__add", 
      "inputs": [[70, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_att_self_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_att_self_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "encoder_transformer_0_att_self_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0], [87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_att_self_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(144, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_0_att_self_i2h_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "144"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "encoder_transformer_0_att_self_split0", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "encoder_transformer_0_att_self__mulscalar0", 
      "attrs": {"scalar": "0.408248290463863"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_0_att_self_reshape0", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_0_att_self_transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_0_att_self_reshape1", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_0_att_self_reshape2", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[91, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_0_att_self_transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_0_att_self_reshape3", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_0_att_self_dot_attbatch_dot0", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[95, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "split0", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "2", 
        "squeeze_axis": "True"
      }, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "_not_equal_scalar", 
      "name": "_not_equal_scalar0", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "sum0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "encoder_transformer_biaszeros_like0", 
      "inputs": [[102, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_biasreshape0", 
      "attrs": {"shape": "(-1, 1)"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "broadcast_like", 
      "name": "encoder_transformer_biasbroadcast_like0", 
      "attrs": {
        "lhs_axes": "(1,)", 
        "rhs_axes": "(1,)"
      }, 
      "inputs": [[104, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "SequenceMask", 
      "name": "encoder_transformer_biassequencemask0", 
      "attrs": {
        "axis": "1", 
        "use_sequence_length": "True", 
        "value": "-99999999.0"
      }, 
      "inputs": [[105, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "encoder_transformer_biasexpand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "broadcast_to", 
      "name": "encoder_transformer_biasbroadcast_to0", 
      "attrs": {"shape": "[0, 8, 0]"}, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_biasreshape1", 
      "attrs": {"shape": "[-3, 0]"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "encoder_transformer_biasblockgrad0", 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "expand_dims2", 
      "attrs": {"axis": "1"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_0_att_self_dot_attbroadcast_add0", 
      "inputs": [[99, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "encoder_transformer_0_att_self_dot_attsoftmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_0_att_self_dot_attdropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_0_att_self_reshape4", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[91, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_0_att_self_transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_0_att_self_reshape5", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_0_att_self_dot_attbatch_dot1", 
      "inputs": [[114, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_0_att_self_reshape6", 
      "attrs": {"shape": "(-4, -1, 8, 0, 6)"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_0_att_self_transpose3", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_0_att_self_reshape7", 
      "attrs": {"shape": "(-1, 0, 48)"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_att_self_h2o_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_0_att_self_h2o_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "48"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_0_att_self_post_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_0_att_self_post__plus0", 
      "inputs": [[124, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "encoder_transformer_0_ff_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[125, 0, 0], [126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_0_ff_i2h_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "16"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "encoder_transformer_0_ff_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_0_ff_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_h2o_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_0_ff_h2o_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_0_ff_h2o_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "48"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_0_ff_post_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_0_ff_post__plus0", 
      "inputs": [[137, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_att_self_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_att_self_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "encoder_transformer_1_att_self_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_att_self_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(144, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_1_att_self_i2h_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "144"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "encoder_transformer_1_att_self_split0", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "encoder_transformer_1_att_self__mulscalar0", 
      "attrs": {"scalar": "0.408248290463863"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_1_att_self_reshape0", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_1_att_self_transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_1_att_self_reshape1", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_1_att_self_reshape2", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[144, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_1_att_self_transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_1_att_self_reshape3", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_1_att_self_dot_attbatch_dot0", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[148, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_1_att_self_dot_attbroadcast_add0", 
      "inputs": [[152, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "encoder_transformer_1_att_self_dot_attsoftmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_1_att_self_dot_attdropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_1_att_self_reshape4", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[144, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_1_att_self_transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_1_att_self_reshape5", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_1_att_self_dot_attbatch_dot1", 
      "inputs": [[155, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_1_att_self_reshape6", 
      "attrs": {"shape": "(-4, -1, 8, 0, 6)"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_1_att_self_transpose3", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_1_att_self_reshape7", 
      "attrs": {"shape": "(-1, 0, 48)"}, 
      "inputs": [[161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_att_self_h2o_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_1_att_self_h2o_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "48"
      }, 
      "inputs": [[162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_1_att_self_post_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_1_att_self_post__plus0", 
      "inputs": [[165, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "encoder_transformer_1_ff_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[166, 0, 0], [167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_1_ff_i2h_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "16"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "encoder_transformer_1_ff_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_1_ff_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_h2o_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_1_ff_h2o_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_1_ff_h2o_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "48"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_1_ff_post_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_1_ff_post__plus0", 
      "inputs": [[178, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_att_self_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_att_self_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "encoder_transformer_2_att_self_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[179, 0, 0], [180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_att_self_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(144, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_2_att_self_i2h_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "144"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "encoder_transformer_2_att_self_split0", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "encoder_transformer_2_att_self__mulscalar0", 
      "attrs": {"scalar": "0.408248290463863"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_2_att_self_reshape0", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_2_att_self_transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_2_att_self_reshape1", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_2_att_self_reshape2", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[185, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_2_att_self_transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_2_att_self_reshape3", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_2_att_self_dot_attbatch_dot0", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[189, 0, 0], [192, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_2_att_self_dot_attbroadcast_add0", 
      "inputs": [[193, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "encoder_transformer_2_att_self_dot_attsoftmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_2_att_self_dot_attdropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_2_att_self_reshape4", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[185, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_2_att_self_transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_2_att_self_reshape5", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_2_att_self_dot_attbatch_dot1", 
      "inputs": [[196, 0, 0], [199, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_2_att_self_reshape6", 
      "attrs": {"shape": "(-4, -1, 8, 0, 6)"}, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_2_att_self_transpose3", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[201, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_2_att_self_reshape7", 
      "attrs": {"shape": "(-1, 0, 48)"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_att_self_h2o_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_2_att_self_h2o_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "48"
      }, 
      "inputs": [[203, 0, 0], [204, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_2_att_self_post_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[205, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_2_att_self_post__plus0", 
      "inputs": [[206, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "encoder_transformer_2_ff_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[207, 0, 0], [208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_2_ff_i2h_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "16"
      }, 
      "inputs": [[210, 0, 0], [211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "encoder_transformer_2_ff_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_2_ff_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_h2o_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_2_ff_h2o_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_2_ff_h2o_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "48"
      }, 
      "inputs": [[215, 0, 0], [216, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_2_ff_post_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_2_ff_post__plus0", 
      "inputs": [[219, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_att_self_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_att_self_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "encoder_transformer_3_att_self_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_att_self_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(144, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_3_att_self_i2h_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "144"
      }, 
      "inputs": [[223, 0, 0], [224, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "encoder_transformer_3_att_self_split0", 
      "attrs": {
        "axis": "2", 
        "num_outputs": "3"
      }, 
      "inputs": [[225, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "encoder_transformer_3_att_self__mulscalar0", 
      "attrs": {"scalar": "0.408248290463863"}, 
      "inputs": [[226, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_3_att_self_reshape0", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_3_att_self_transpose0", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_3_att_self_reshape1", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[229, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_3_att_self_reshape2", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[226, 1, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_3_att_self_transpose1", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_3_att_self_reshape3", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[232, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_3_att_self_dot_attbatch_dot0", 
      "attrs": {"transpose_b": "True"}, 
      "inputs": [[230, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "encoder_transformer_3_att_self_dot_attbroadcast_add0", 
      "inputs": [[234, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "encoder_transformer_3_att_self_dot_attsoftmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_3_att_self_dot_attdropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_3_att_self_reshape4", 
      "attrs": {"shape": "(0, -1, 8, 6)"}, 
      "inputs": [[226, 2, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_3_att_self_transpose2", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_3_att_self_reshape5", 
      "attrs": {"shape": "(-3, -1, 6)"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "encoder_transformer_3_att_self_dot_attbatch_dot1", 
      "inputs": [[237, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_3_att_self_reshape6", 
      "attrs": {"shape": "(-4, -1, 8, 0, 6)"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "encoder_transformer_3_att_self_transpose3", 
      "attrs": {"axes": "(0, 2, 1, 3)"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "encoder_transformer_3_att_self_reshape7", 
      "attrs": {"shape": "(-1, 0, 48)"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_att_self_h2o_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(48, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "encoder_transformer_3_att_self_h2o_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "True", 
        "num_hidden": "48"
      }, 
      "inputs": [[244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "encoder_transformer_3_att_self_post_dropout0", 
      "attrs": {"p": "0.1"}, 
      "inputs": [[246, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "encoder_transformer_3_att_self_post__plus0", 
      "inputs": [[247, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_ff_pre_norm_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 1.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_ff_pre_norm_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 0.0}]", 
        "__lr_mult__": "1.0", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "encoder_transformer_3_ff_pre_normlayernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-06", 
        "output_mean_var": "False"
      }, 
      "inputs": [[248, 0, 0], [249, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder_transformer_3_ff_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
